; ModuleID = 'cpu/cpu.bpf.c'
source_filename = "cpu/cpu.bpf.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [6 x i32]*, [1 x i32]*, i32*, %struct.unwind_state* }
%struct.unwind_state = type { i64, i64, i64, i32, %struct.stack_trace_t }
%struct.stack_trace_t = type { i64, [115 x i64] }
%struct.anon.0 = type { [3 x i32]*, [1 x i32]*, i32*, i32* }
%struct.anon.1 = type { [1 x i32]*, [32 x i32]*, i32*, i8* }
%struct.anon.2 = type { [1 x i32]*, [10240 x i32]*, %struct.stack_count_key*, i64* }
%struct.stack_count_key = type { i32, i32, i32, i32, i32 }
%struct.anon.3 = type { [7 x i32]*, [1024 x i32]*, i32*, [115 x i64]* }
%struct.anon.4 = type { [1 x i32]*, [1024 x i32]*, i32*, %struct.stack_trace_t* }
%struct.anon.5 = type { [1 x i32]*, [2 x i32]*, %struct.unwind_tables_key*, %struct.stack_unwind_table_t* }
%struct.unwind_tables_key = type { i32, i32 }
%struct.stack_unwind_table_t = type { i64, i64, i64, i64, [250000 x %struct.stack_unwind_row] }
%struct.stack_unwind_row = type { i64, i16, i8, i8, i16, i16 }
%struct.anon.6 = type { [6 x i32]*, [10 x i32]*, i32*, i32* }
%struct.bpf_perf_event_data = type { %struct.pt_regs, i64, i64 }
%struct.pt_regs = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }

@heap = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "heap", scope: !2, file: !3, line: 182, type: !234, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.5 (Fedora 14.0.5-2.fc36)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !33, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "cpu/cpu.bpf.c", directory: "/home/javierhonduco/code/parca-agent/bpf")
!4 = !{!5, !11, !15, !22}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "cpu/../common.h", directory: "/home/javierhonduco/code/parca-agent/bpf")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0)
!10 = !DIEnumerator(name: "true", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stack_walking_method", file: !3, line: 61, baseType: !7, size: 32, elements: !12)
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "STACK_WALKING_METHOD_FP", value: 0)
!14 = !DIEnumerator(name: "STACK_WALKING_METHOD_DWARF", value: 1)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 84, baseType: !7, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "BPF_F_SKIP_FIELD_MASK", value: 255)
!18 = !DIEnumerator(name: "BPF_F_USER_STACK", value: 256)
!19 = !DIEnumerator(name: "BPF_F_FAST_STACK_CMP", value: 512)
!20 = !DIEnumerator(name: "BPF_F_REUSE_STACKID", value: 1024)
!21 = !DIEnumerator(name: "BPF_F_USER_BUILD_ID", value: 2048)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 43, baseType: !7, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27}
!24 = !DIEnumerator(name: "BPF_ANY", value: 0)
!25 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!26 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!27 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!28 = !{!29, !30, !31}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !3, line: 302, baseType: !7)
!33 = !{!34, !36, !42, !63, !88, !112, !127, !0, !172, !188, !200, !206, !213, !219, !224, !229}
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "VERSION", scope: !2, file: !3, line: 631, type: !7, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "LICENSE", scope: !2, file: !3, line: 632, type: !38, isLocal: false, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 32, elements: !40)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!40 = !{!41}
!41 = !DISubrange(count: 4)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "debug_pids", scope: !2, file: !3, line: 170, type: !44, isLocal: false, isDefinition: true)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 170, size: 256, elements: !45)
!45 = !{!46, !51, !56, !58}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !44, file: !3, line: 170, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 32, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 1)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !44, file: !3, line: 170, baseType: !52, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1024, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !44, file: !3, line: 170, baseType: !57, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !44, file: !3, line: 170, baseType: !59, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !6, line: 19, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !6, line: 8, baseType: !62)
!62 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "stack_counts", scope: !2, file: !3, line: 171, type: !65, isLocal: false, isDefinition: true)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 171, size: 256, elements: !66)
!66 = !{!67, !68, !73, !83}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !3, line: 171, baseType: !47, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !65, file: !3, line: 171, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 327680, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 10240)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !65, file: !3, line: 171, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_count_key_t", file: !3, line: 100, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_count_key", file: !3, line: 94, size: 160, elements: !77)
!77 = !{!78, !79, !80, !81, !82}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !76, file: !3, line: 95, baseType: !30, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !76, file: !3, line: 96, baseType: !30, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "user_stack_id", scope: !76, file: !3, line: 97, baseType: !30, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_stack_id", scope: !76, file: !3, line: 98, baseType: !30, size: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "user_stack_id_dwarf", scope: !76, file: !3, line: 99, baseType: !30, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !65, file: !3, line: 171, baseType: !84, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !6, line: 17, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !6, line: 16, baseType: !87)
!87 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "stack_traces", scope: !2, file: !3, line: 172, type: !90, isLocal: false, isDefinition: true)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 172, size: 256, elements: !91)
!91 = !{!92, !97, !102, !106}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !3, line: 172, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 224, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 7)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !90, file: !3, line: 172, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 32768, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1024)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !90, file: !3, line: 172, baseType: !103, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !6, line: 22, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !6, line: 11, baseType: !7)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !90, file: !3, line: 172, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_trace_type", file: !3, line: 79, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 7360, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 115)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "dwarf_stack_traces", scope: !2, file: !3, line: 173, type: !114, isLocal: false, isDefinition: true)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 173, size: 256, elements: !115)
!115 = !{!116, !117, !118, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !3, line: 173, baseType: !47, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !114, file: !3, line: 173, baseType: !98, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !114, file: !3, line: 173, baseType: !57, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !114, file: !3, line: 173, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_trace_t", file: !3, line: 92, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_trace_t", file: !3, line: 89, size: 7424, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !122, file: !3, line: 90, baseType: !85, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "addresses", scope: !122, file: !3, line: 91, baseType: !126, size: 7360, offset: 64)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 7360, elements: !110)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "unwind_tables", scope: !2, file: !3, line: 174, type: !129, isLocal: false, isDefinition: true)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 174, size: 256, elements: !130)
!130 = !{!131, !132, !137, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !3, line: 174, baseType: !47, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !129, file: !3, line: 174, baseType: !133, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 64, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 2)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !129, file: !3, line: 174, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "unwind_tables_key_t", file: !3, line: 105, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unwind_tables_key", file: !3, line: 102, size: 64, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !140, file: !3, line: 103, baseType: !30, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "shard", scope: !140, file: !3, line: 104, baseType: !30, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !129, file: !3, line: 174, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_unwind_table_t", file: !3, line: 163, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_unwind_table_t", file: !3, line: 157, size: 32000256, elements: !148)
!148 = !{!149, !150, !151, !152, !153}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "low_pc", scope: !147, file: !3, line: 158, baseType: !85, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "high_pc", scope: !147, file: !3, line: 159, baseType: !85, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "table_len", scope: !147, file: !3, line: 160, baseType: !85, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__explicit_padding", scope: !147, file: !3, line: 161, baseType: !85, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !147, file: !3, line: 162, baseType: !154, size: 32000000, offset: 256)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 32000000, elements: !170)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_unwind_row_t", file: !3, line: 134, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_unwind_row", file: !3, line: 127, size: 128, elements: !157)
!157 = !{!158, !159, !163, !164, !165, !169}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !156, file: !3, line: 128, baseType: !85, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved_do_not_use", scope: !156, file: !3, line: 129, baseType: !160, size: 16, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !6, line: 20, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !6, line: 9, baseType: !162)
!162 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cfa_type", scope: !156, file: !3, line: 130, baseType: !60, size: 8, offset: 80)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "rbp_type", scope: !156, file: !3, line: 131, baseType: !60, size: 8, offset: 88)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "cfa_offset", scope: !156, file: !3, line: 132, baseType: !166, size: 16, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !6, line: 21, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !6, line: 10, baseType: !168)
!168 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rbp_offset", scope: !156, file: !3, line: 133, baseType: !166, size: 16, offset: 112)
!170 = !{!171}
!171 = !DISubrange(count: 250000)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "percpu_stats", scope: !2, file: !3, line: 189, type: !174, isLocal: false, isDefinition: true)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 184, size: 256, elements: !175)
!175 = !{!176, !181, !186, !187}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !174, file: !3, line: 185, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 192, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 6)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !174, file: !3, line: 186, baseType: !182, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 320, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 10)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !174, file: !3, line: 187, baseType: !103, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !174, file: !3, line: 188, baseType: !103, size: 64, offset: 192)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "programs", scope: !2, file: !3, line: 196, type: !190, isLocal: false, isDefinition: true)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 191, size: 256, elements: !191)
!191 = !{!192, !197, !198, !199}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !190, file: !3, line: 192, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 96, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 3)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !190, file: !3, line: 193, baseType: !47, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !190, file: !3, line: 194, baseType: !103, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !190, file: !3, line: 195, baseType: !103, size: 64, offset: 192)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "bpf_get_current_pid_tgid", scope: !2, file: !202, line: 367, type: !203, isLocal: true, isDefinition: true)
!202 = !DIFile(filename: "../dist/libbpf/amd64/usr/include/bpf/bpf_helper_defs.h", directory: "/home/javierhonduco/code/parca-agent/bpf")
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!86}
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !202, line: 55, type: !208, isLocal: true, isDefinition: true)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!29, !29, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "bpf_probe_read_user", scope: !2, file: !202, line: 2768, type: !215, isLocal: true, isDefinition: true)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !29, !105, !211}
!218 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "bpf_get_stackid", scope: !2, file: !202, line: 759, type: !221, isLocal: true, isDefinition: true)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!218, !29, !29, !86}
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !202, line: 77, type: !226, isLocal: true, isDefinition: true)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!218, !29, !211, !211, !86}
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "bpf_tail_call", scope: !2, file: !202, line: 326, type: !231, isLocal: true, isDefinition: true)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!218, !29, !29, !105}
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 177, size: 256, elements: !235)
!235 = !{!236, !237, !238, !239}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !3, line: 178, baseType: !177, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !234, file: !3, line: 179, baseType: !47, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !234, file: !3, line: 180, baseType: !103, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !234, file: !3, line: 181, baseType: !240, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "unwind_state_t", file: !3, line: 113, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unwind_state", file: !3, line: 107, size: 7680, elements: !243)
!243 = !{!244, !245, !246, !247, !248}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !242, file: !3, line: 108, baseType: !85, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !242, file: !3, line: 109, baseType: !85, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !242, file: !3, line: 110, baseType: !85, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tail_calls", scope: !242, file: !3, line: 111, baseType: !104, size: 32, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !242, file: !3, line: 112, baseType: !121, size: 7424, offset: 256)
!249 = !{i32 7, !"Dwarf Version", i32 4}
!250 = !{i32 2, !"Debug Info Version", i32 3}
!251 = !{i32 1, !"wchar_size", i32 4}
!252 = !{i32 7, !"frame-pointer", i32 2}
!253 = !{!"clang version 14.0.5 (Fedora 14.0.5-2.fc36)"}
!254 = distinct !DISubprogram(name: "walk_user_stacktrace_impl", scope: !3, file: !3, line: 385, type: !255, scopeLine: 385, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !288)
!255 = !DISubroutineType(types: !256)
!256 = !{!30, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_perf_event_data", file: !6, line: 124, size: 1472, elements: !259)
!259 = !{!260, !286, !287}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !258, file: !6, line: 125, baseType: !261, size: 1344)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_user_pt_regs_t", file: !6, line: 122, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_regs", file: !6, line: 98, size: 1344, elements: !263)
!263 = !{!264, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "r15", scope: !262, file: !6, line: 99, baseType: !265, size: 64)
!265 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "r14", scope: !262, file: !6, line: 100, baseType: !265, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "r13", scope: !262, file: !6, line: 101, baseType: !265, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "r12", scope: !262, file: !6, line: 102, baseType: !265, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !262, file: !6, line: 103, baseType: !265, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !262, file: !6, line: 104, baseType: !265, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "r11", scope: !262, file: !6, line: 105, baseType: !265, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "r10", scope: !262, file: !6, line: 106, baseType: !265, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "r9", scope: !262, file: !6, line: 107, baseType: !265, size: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "r8", scope: !262, file: !6, line: 108, baseType: !265, size: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !262, file: !6, line: 109, baseType: !265, size: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !262, file: !6, line: 110, baseType: !265, size: 64, offset: 704)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !262, file: !6, line: 111, baseType: !265, size: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !262, file: !6, line: 112, baseType: !265, size: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !262, file: !6, line: 113, baseType: !265, size: 64, offset: 896)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "orig_ax", scope: !262, file: !6, line: 114, baseType: !265, size: 64, offset: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !262, file: !6, line: 115, baseType: !265, size: 64, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !262, file: !6, line: 116, baseType: !265, size: 64, offset: 1088)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !262, file: !6, line: 117, baseType: !265, size: 64, offset: 1152)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !262, file: !6, line: 118, baseType: !265, size: 64, offset: 1216)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !262, file: !6, line: 119, baseType: !265, size: 64, offset: 1280)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sample_period", scope: !258, file: !6, line: 126, baseType: !86, size: 64, offset: 1344)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !258, file: !6, line: 127, baseType: !86, size: 64, offset: 1408)
!288 = !{!289, !290, !291, !292, !295, !296, !297, !299, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !316, !317, !318, !319, !320, !323}
!289 = !DILocalVariable(name: "ctx", arg: 1, scope: !254, file: !3, line: 385, type: !257)
!290 = !DILocalVariable(name: "pid_tgid", scope: !254, file: !3, line: 386, type: !85)
!291 = !DILocalVariable(name: "user_pid", scope: !254, file: !3, line: 387, type: !30)
!292 = !DILocalVariable(name: "reached_bottom_of_stack", scope: !254, file: !3, line: 389, type: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !6, line: 37, baseType: !294)
!294 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!295 = !DILocalVariable(name: "zero", scope: !254, file: !3, line: 390, type: !85)
!296 = !DILocalVariable(name: "unwind_state", scope: !254, file: !3, line: 392, type: !240)
!297 = !DILocalVariable(name: "i", scope: !298, file: !3, line: 399, type: !30)
!298 = distinct !DILexicalBlock(scope: !254, file: !3, line: 399, column: 3)
!299 = !DILocalVariable(name: "unwind_table", scope: !300, file: !3, line: 401, type: !145)
!300 = distinct !DILexicalBlock(scope: !301, file: !3, line: 399, column: 57)
!301 = distinct !DILexicalBlock(scope: !298, file: !3, line: 399, column: 3)
!302 = !DILocalVariable(name: "table_idx", scope: !300, file: !3, line: 409, type: !85)
!303 = !DILocalVariable(name: "len", scope: !300, file: !3, line: 421, type: !85)
!304 = !DILocalVariable(name: "aa", scope: !300, file: !3, line: 430, type: !155)
!305 = !DILocalVariable(name: "found_pc", scope: !300, file: !3, line: 432, type: !85)
!306 = !DILocalVariable(name: "found_cfa_type", scope: !300, file: !3, line: 433, type: !60)
!307 = !DILocalVariable(name: "found_rbp_type", scope: !300, file: !3, line: 434, type: !60)
!308 = !DILocalVariable(name: "found_cfa_offset", scope: !300, file: !3, line: 435, type: !166)
!309 = !DILocalVariable(name: "found_rbp_offset", scope: !300, file: !3, line: 436, type: !166)
!310 = !DILocalVariable(name: "previous_rsp", scope: !300, file: !3, line: 444, type: !85)
!311 = !DILocalVariable(name: "threshold", scope: !312, file: !3, line: 455, type: !85)
!312 = distinct !DILexicalBlock(scope: !313, file: !3, line: 449, column: 55)
!313 = distinct !DILexicalBlock(scope: !314, file: !3, line: 449, column: 16)
!314 = distinct !DILexicalBlock(scope: !315, file: !3, line: 447, column: 16)
!315 = distinct !DILexicalBlock(scope: !300, file: !3, line: 445, column: 9)
!316 = !DILocalVariable(name: "previous_rip_addr", scope: !300, file: !3, line: 484, type: !85)
!317 = !DILocalVariable(name: "previous_rip", scope: !300, file: !3, line: 487, type: !85)
!318 = !DILocalVariable(name: "err", scope: !300, file: !3, line: 488, type: !30)
!319 = !DILocalVariable(name: "previous_rbp", scope: !300, file: !3, line: 499, type: !85)
!320 = !DILocalVariable(name: "previous_rbp_addr", scope: !321, file: !3, line: 503, type: !85)
!321 = distinct !DILexicalBlock(scope: !322, file: !3, line: 502, column: 12)
!322 = distinct !DILexicalBlock(scope: !300, file: !3, line: 500, column: 9)
!323 = !DILocalVariable(name: "ret", scope: !321, file: !3, line: 505, type: !30)
!324 = !DILocation(line: 0, scope: !254)
!325 = !DILocation(line: 386, column: 18, scope: !254)
!326 = !DILocation(line: 387, column: 18, scope: !254)
!327 = !DILocation(line: 390, column: 3, scope: !254)
!328 = !DILocation(line: 390, column: 7, scope: !254)
!329 = !{!330, !330, i64 0}
!330 = !{!"long long", !331, i64 0}
!331 = !{!"omnipotent char", !332, i64 0}
!332 = !{!"Simple C/C++ TBAA"}
!333 = !DILocation(line: 392, column: 34, scope: !254)
!334 = !DILocation(line: 393, column: 20, scope: !335)
!335 = distinct !DILexicalBlock(scope: !254, file: !3, line: 393, column: 7)
!336 = !DILocation(line: 393, column: 7, scope: !254)
!337 = !DILocation(line: 0, scope: !298)
!338 = !DILocation(line: 402, column: 51, scope: !300)
